window.ConfigParam = {
    total: 10,
    stars: 5
}

/**
 * [ConfigDOM 渲染DOM所需数据]
 *
 * 数据类型分为两种，一种是无分组(group)属性，如一星; 一种是包含分组，如二星。
 * @type {Object}
 */
window.ConfigDOM = {

    "一星": [{
        m: "标准选号",
        intro: "从个位选择1个或多个号码，选号与开奖号码个位一致即中奖11元。",
        type: "一星",
        pos: [1, 1]
    }],

    "二星": [{
        group: "直选",
        data: [{
            m: "标准选号",
            intro: "从00~99中任选1个或多个2位数，与开奖号码后两位相同则中奖116.00元。",
            type: "两星直选",
            pos: [2, 1]
        },{
            m: "手工录入",
            intro: "任选2个号码组成一注有效注，与开奖号码后两位相同则中奖116.00元。",
            type: "两星直选",
            pos: [2, 2]
        }]
    },{
        group: "组选",
        data: [{
            m: "组选包号",
            intro: "至少选择2个号码，开奖号码后两位含在选号中则中奖(若只选两个号，开奖号后两位为对子时不中奖)。十位个位如果为对子，奖金为116元，非对子奖金58元。",
            type: "两星组选包号",
            pos: [2, 3]
        },{
            m: "组选和值",
            intro: "开奖号码十位和个位的和值与您选好一致则中奖。十位个位如果为对子，奖金为116元，非对子奖金58元。",
            type: "两星组选和值",
            pos: [2, 4]
        },{
            m: "组选胆拖",
            intro: "从0~9中任选1个胆码,多个拖码进行投注，开奖号码后两位含在选号中则中奖(若只选两个号，开奖号后两位为对子时不中奖)。十位个位如果为对子，奖金为116元，非对子奖金58元。",
            type: "两星组选胆拖",
            pos: [2, 5]
        },{
            m: "手工录入",
            intro: "任选2个号码组成一注有效注，开奖号码后两位不为对子且含在选号中则中奖,奖金58元。",
            type: "两星组选",
            pos: [2, 6]
        }]
    }],

    "三星直选": [{
        m: "标准选号",
        intro: "从三位各选1个或多个号码，选号与开奖号后三位按位一致即中1160元。",
        type: "三星直选",
        pos: [3, 1]
    },{
        m: "和值选号",
        intro: "所选和值与开奖号码和值一致，即中奖1160元。",
        type: "三星直选和值",
        pos: [3, 2]
    },{
        m: "直选胆拖",
        intro: "选1-2个胆码，多个拖码，胆码对，剩下的开奖数字全部包含在拖码中，即中奖1160元，直选胆拖不包含组三和豹子。 ",
        type: "三星直选胆拖",
        pos: [3, 3]
    },{
        m: "直选跨度",
        intro: "至少从0-9中选择1个跨度，所选跨度与开奖号码跨度一致，即中奖1160元。",
        type: "三星直选跨度",
        pos: [3, 4]
    },{
        m: "手工录入",
        intro: "任选3个号码组成一注有效注，选号与开奖号后三位按位一致即中1160元。",
        type: "三星直选",
        pos: [3, 5]
    }],

    "三星组选": [{
        group: "组三",
        data: [{
            m: "标准",
            intro: "3个数字有两个数字相同，与开奖号后三位相同即中奖，奖金385元。",
            type: "三星组三组选",
            pos: [4, 1]
        },{
            m: "包号",
            intro: "至少选择2个号码，开奖号码为组三且含在包号号码中即中奖385元。",
            type: "三星组三包号",
            pos: [4, 2]
        },{
            m: "和值",
            intro: "请从1－26中选择组选三和值，单注奖金385元。",
            type: "三星组三和值",
            pos: [4, 3]
        },{
            m: "手工录入",
            intro: "任选一个非豹子的3个号码组成一注有效注，组三385元 / 组六190元。",
            type: "三星组选",
            pos: [4, 4]
        }]
    },{
        group: "组六",
        data: [{
            m: "包号",
            intro: "至少选择3个号码，开奖号码为组六且含在包号号码中即中奖190元。",
            type: "三星组六组选",
            pos: [4, 5]
        },{
            m: "和值",
            intro: "请从3－24中选择组选六和值，单注奖金190元。",
            type: "三星组六和值",
            pos: [4, 6]
        },{
            m: "胆拖",
            intro: "从0~9中任选1-2个胆码,多个拖码进行投注，开奖号码为组六且含在包号号码中即中奖190元。",
            type: "三星组六胆拖",
            pos: [4, 7]
        },{
            m: "手工录入",
            intro: "任选一个非豹子的3个号码组成一注有效注，组三385元 / 组六190元。",
            type: "三星组六组选",
            pos: [4, 8]
        }]
    }],

    "四星": [{
        m: "标准选号",
        intro: "从四位各选1个或多个号码，选号与开奖号后四位按位一致即中1万元,与中间三位或后三位按位一致即中88元！。",
        type: "四星直选",
        pos: [5, 1]
    }],

    "五星": [{
        group: "直选",
        data: [{
            m: "标准选号",
            intro: "从00000~99999中任选1个或多个5位数，单注奖金11.6万元。",
            type: "五星直选",
            pos: [6, 1]
        },{
            m: "手工录入",
            intro: "任选5个号码组成一注有效注，单注奖金11.6万元。",
            type: "五星直选",
            pos: [6, 2]
        }]          
    },{
        group: "通选",
        data: [{
            m: "标准选号",
            intro: "从五位各选1个号码，选号与开奖号按位一致即中2万元，前三或后三位按位一致即中200元，前二或后二位按位一致即中30元。",
            type: "五星通选",
            pos: [6, 3]
        },{
            m: "手工录入",
            intro: "任选5个号码组成一注有效注，选号与开奖号按位一致即中2万元，前三或后三位按位一致即中200元，前二或后二位按位一致即中30元。",
            type: "五星通选",
            pos: [6, 4]
        }]
    }],

    "大小单双": [{
        m: "标准选号",
        intro: "选择开奖号码的个、十两位号码属性，单注奖金4.00元。",
        type: "大小单双",
        pos: [7, 1]
    }],

    "任选一": [{
        m: "标准选号",
        intro: "从5位中定位选择1个或多个号码，单注奖金11.00元。",
        type: "任选一",
        pos: [8, 1]
    }],

    "任选二": [{
        m: "标准选号",
        intro: "从5位中定位选择2个或更多号码，单注奖金116.00元。",
        type: "任选二",
        pos: [9, 1]
    }]
};